Repository: SaicharanB2H/Sih_flutter_project
Catalog: lib/l10n/app_*.arb
Languages: as, or

# appTitle
source: AgriAdvisor AI
as: কৃষি উপদেষ্টা AI
or: କୃଷି ଉପଦେଷ୍ଟା AI

# welcome
source: Welcome to AgriAdvisor AI
as: কৃষি উপদেষ্টা AI লৈ আপোনাৰ স্বাগতম
or: କୃଷି ଉପଦେଷ୍ଟା AI ରେ ଆପଣଙ୍କୁ ସ୍ୱାଗତ

# welcomeMessage
source: Your smart farming companion for better crop management
as: উন্নত ফসল ব্যৱস্থাপনাৰ বাবে আপোনাৰ স্মাৰ্ট কৃষি সঙ্গী
or: ଉତ୍ତମ ଫସଲ ପରିଚାଳନା ପାଇଁ ଆପଣଙ୍କର ସ୍ମାର୍ଟ କୃଷି ସାଥୀ

source: Sign In
as: ছাইন ইন
or: ସାଇନ୍ ଇନ୍

source: Sign Up
as: ছাইন আপ
or: ସାଇନ୍ ଅପ୍

source: Sign Out
as: ছাইন আউট
or: ସାଇନ୍ ଆଉଟ୍

source: Email
as: ইমেইল
or: ଇମେଇଲ୍

source: Password
as: পাছৱৰ্ড
or: ପାସୱାର୍ଡ୍

source: Confirm Password
as: পাছৱৰ্ড নিশ্চিত কৰক
or: ପାସୱାର୍ଡ୍ ନିଶ୍ଚିତ କରନ୍ତୁ

# name
source: Full Name
as: সম্পূৰ্ণ নাম
or: ସମ୍ପୂର୍ଣ୍ଣ ନାମ

source: Phone Number
as: ফোন নম্বৰ
or: ଫୋନ୍ ନମ୍ବର

source: Forgot Password?
as: পাছৱৰ্ড পাহৰি গেলে?
or: ପାସୱାର୍ଡ୍ ଭୁଲିଗଲେ କି?

source: Create Account
as: একাউন্ট সৃষ্টি কৰক
or: ଏକାଉଣ୍ଟ୍ ସୃଷ୍ଟି କରନ୍ତୁ

# alreadyHaveAccount
source: Already have an account?
as: ইতিমধ্যে একাউন্ট আছেনে?
or: ପୂର୍ବରୁ ଏକାଉଣ୍ଟ୍ ଅଛି କି?

# dontHaveAccount
source: Don't have an account?
as: একাউন্ট নাইনে?
or: ଏକାଉଣ୍ଟ୍ ନାହିଁ କି?

source: Select Language
as: ভাষা বাছক
or: ଭାଷା ଚୟନ କରନ୍ତୁ

source: Farm Details
as: খেতিৰ বিৱৰণ
or: ଖେତର ବିବରଣୀ

source: Location
as: অৱস্থান
or: ଅବସ୍ଥିତି

source: Farm Name
as: খেতিৰ নাম
or: ଖେତର ନାମ

# farmSize
source: Farm Size (Acres)
as: খেতিৰ আকাৰ (একৰ)
or: ଖେତର ଆକାର (ଏକର)

source: Soil Type
as: মাটিৰ ধৰণ
or: ମାଟିର ପ୍ରକାର

source: Primary Crops
as: প্ৰাথমিক ফসলসমূহ
or: ପ୍ରାଥମିକ ଫସଲ

source: Next
as: পৰৱৰ্তী
or: ପରବର୍ତ୍ତୀ

source: Back
as: পিছলৈ
or: ପଛକୁ

source: Finish
as: সমাপ্ত
or: ସମାପ୍ତ

# enterFarmName
source: Enter your farm name
as: আপোনাৰ খেতিৰ নাম লিখক
or: ଆପଣଙ୍କର ଖେତର ନାମ ପ୍ରବେଶ କରନ୍ତୁ

# enterFarmSize
source: Enter farm size in acres
as: একৰত খেতিৰ আকাৰ লিখক
or: ଏକରରେ ଖେତର ଆକାର ପ୍ରବେଶ କରନ୍ତୁ

# farmDetailsDescription
source: Tell us about your farm. We'll detect soil type automatically using your location.
as: আমাক আপোনাৰ খেতিৰ বিষয়ে কওক। আমি আপোনাৰ অৱস্থান ব্যৱহাৰ কৰি মাটিৰ ধৰণ স্বয়ংক্ৰিয়ভাৱে চিনাক্ত কৰিম।
or: ଆମକୁ ଆପଣଙ୍କର ଖେତ ବିଷୟରେ କୁହନ୍ତୁ। ଆମେ ଆପଣଙ୍କର ଅବସ୍ଥିତି ଉପଯୋଗ କରି ମାଟିର ପ୍ରକାର ସ୍ୱୟଂଚାଳିତ ଭାବରେ ଚିହ୍ନଟ କରିବୁ।

source: crops selected
as: ফসলসমূহ বাছনি কৰা হৈছে
or: ଫସଲଗୁଡ଼ିକ ଚୟନ କରାଯାଇଛି

source: Dashboard
as: ডেশবৰ্ড
or: ଡ୍ୟାସବୋର୍ଡ୍

source: Today's Weather
as: আজিৰ পৰিৱেশন
or: ଆଜିର ପରିବେଶନ

source: Market Prices
as: বজাৰৰ দাম
or: ବଜାର ମୂଲ୍ୟ

source: Recent Diagnosis
as: শেহতীয়া নিৰ্ণয়
or: ସାମ୍ପ୍ରତିକ ନିଦାନ

# askQuestion
source: Ask a Question
as: প্ৰশ্ন সুধক
or: ପ୍ରଶ୍ନ ପଚାରନ୍ତୁ

source: View All
as: সকলো চাওক
or: ସବୁ ଦେଖନ୍ତୁ

source: Plant Diagnosis
as: উদ্ভিদ নিৰ্ণয়
or: ଉଦ୍ଭିଦ ନିଦାନ

source: Capture Photo
as: ছবি লওক
or: ଫୋଟୋ ନିଅନ୍ତୁ

source: Select from Gallery
as: গেলাৰীৰ পৰা বাছক
or: ଗ୍ୟାଲେରୀରୁ ଚୟନ କରନ୍ତୁ

source: Analyzing...
as: বিশ্লেষণ কৰা হৈছে...
or: ବିଶ୍ଳେଷଣ କରାଯାଉଛି...

# result
source: Diagnosis Result
as: নিৰ্ণয়ৰ ফলাফল
or: ନିଦାନ ଫଳାଫଳ

source: Confidence
as: আত্মবিশ্বাস
or: ଆତ୍ମବିଶ୍ୱାସ

# treatments
source: Recommended Treatments
as: পৰামৰ্শিত চিকিৎসা
or: ପରାମର୍ଶିତ ଚିକିତ୍ସା

# history
source: Diagnosis History
as: নিৰ্ণয়ৰ ইতিহাস
or: ନିଦାନ ଇତିହାସ

source: Chat
as: চেট
or: ଚାଟ୍

# askAnything
source: Ask anything about farming...
as: কৃষিৰ বিষয়ে যিকোনো সুধক...
or: କୃଷି ବିଷୟରେ ଯାହା ଚାହୁଁଛନ୍ତି ପଚାରନ୍ତୁ...

# typeMessage
source: Type your message...
as: আপোনাৰ বাৰ্তা টাইপ কৰক...
or: ଆପଣଙ୍କର ସନ୍ଦେଶ ଟାଇପ୍ କରନ୍ତୁ...

source: Speak
as: কওক
or: କହନ୍ତୁ

source: Listening...
as: শুনি আছো...
or: ଶୁଣାଯାଉଛି...

source: New Chat
as: নতুন চেট
or: ନୂତନ ଚାଟ୍

source: Weather
as: পৰিৱেশন
or: ପରିବେଶନ

source: Forecast
as: পূৰ্বানুমান
or: ପୂର୍ବାନୁମାନ

source: Alerts
as: সতৰ্কবাৰ্তা
or: ସତର୍କତା

source: Temperature
as: তাপমাত্ৰা
or: ତାପମାତ୍ରା

source: Humidity
as: আৰ্দ্ৰতা
or: ଆର୍ଦ୍ରତା

source: Wind Speed
as: বতাহৰ বেগ
or: ବାତାସର ବେଗ

source: UV Index
as: UV সূচক
or: UV ସୂଚକ

source: Price Alerts
as: দামৰ সতৰ্কবাৰ্তা
or: ମୂଲ୍ୟ ସତର୍କତା

source: Trends
as: প্ৰৱণতা
or: ପ୍ରବୃତ୍ତି

source: Create Alert
as: সতৰ্কবাৰ্তা সৃষ্টি কৰক
or: ସତର୍କତା ସୃଷ୍ଟି କରନ୍ତୁ

source: Crop
as: ফসল
or: ଫସଲ

source: Price
as: দাম
or: ମୂଲ୍ୟ

source: Market
as: বজাৰ
or: ବଜାର

source: Date
as: তাৰিখ
or: ତାରିଖ

source: Profile
as: প্ৰফাইল
or: ପ୍ରୋଫାଇଲ୍

source: Settings
as: ছেটিংচ
or: ସେଟିଂସ୍

source: Language
as: ভাষা
or: ଭାଷା

source: Notifications
as: অধিসূচনাসমূহ
or: ବିଜ୍ଞପ୍ତି

source: About
as: বিষয়ে
or: ବିଷୟରେ

source: Help
as: সহায়
or: ସାହାଯ୍ୟ

source: Feedback
as: প্ৰতিক্ৰিয়া
or: ପ୍ରତିକ୍ରିୟା

source: Loading...
as: ল'ড হৈ আছে...
or: ଲୋଡ୍ ହେଉଛି...

source: Error
as: ত্ৰুটি
or: ତ୍ରୁଟି

source: Retry
as: পুনৰ চেষ্টা কৰক
or: ପୁନଃ ଚେଷ୍ଟା କରନ୍ତୁ

source: Cancel
as: বাতিল কৰক
or: ବାତିଲ୍ କରନ୍ତୁ

source: Save
as: সংৰক্ষণ কৰক
or: ସଂରକ୍ଷଣ କରନ୍ତୁ

source: Delete
as: মচক
or: ମୁଛନ୍ତୁ

source: Edit
as: সম্পাদনা কৰক
or: ସମ୍ପାଦନ କରନ୍ତୁ

source: Search
as: অনুসন্ধান কৰক
or: ଅନୁସନ୍ଧାନ କରନ୍ତୁ

source: Filter
as: ফিল্টাৰ
or: ଫିଲ୍ଟର୍

source: Sort
as: বাছক
or: କ୍ରମାନୁସାରେ ସଜାନ୍ତୁ

# noData
source: No data available
as: কোনো তথ্য নাই
or: କୌଣସି ତଥ୍ୟ ଉପଲବ୍ଧ ନାହିଁ

source: Coming Soon
as: শীঘ্ৰেই আহিছে
or: ଶୀଘ୍ର ଆସୁଛି

# howToGetBestResults
source: How to get the best results
as: সৰ্বোত্তম ফলাফল কেনেকৈ লাভ কৰা যায়
or: ସର୍ବୋତ୍ତମ ଫଳାଫଳ କିପରି ପାଇପାରିବେ

source: Take clear, well-lit photos
as: স্পষ্ট, ভালদৰে আলোকিত ছবি লওক
or: ସ୍ପଷ୍ଟ, ଭଲ ଆଲୋକିତ ଫୋଟୋ ନିଅନ୍ତୁ

source: Focus on affected areas
as: প্ৰভাৱিত অঞ্চলসমূহত মনোযোগ দিয়ক
or: ପ୍ରଭାବିତ ଅଞ୍ଚଳଗୁଡ଼ିକ ଉପରେ ଧ୍ୟାନ କେନ୍ଦ୍ରିତ କରନ୍ତୁ

# includeLeavesStemsFruits
source: Include leaves, stems, or fruits
as: পাত, ডাঙৰ বা ফল অন্তৰ্ভুক্ত কৰক
or: ପତ୍ର, ଡାଣ୍ଡ କିମ୍ବା ଫଳଗୁଡ଼ିକ ଅନ୍ତର୍ଭୁକ୍ତ କରନ୍ତୁ

# avoidBlurryDarkImages
source: Avoid blurry or dark images
as: অস্পষ্ট বা অন্ধকাৰ ছবি এৰি দিয়ক
or: ଅସ୍ପଷ୍ଟ କିମ୍ବା ଅନ୍ଧାର ଛବିଗୁଡ଼ିକୁ ପରିହାର କରନ୍ତୁ

# noPreviousDiagnoses
source: No previous diagnoses Take your first plant photo!
as: কোনো পূৰ্বৱৰ্তী নিৰ্ণয় নাই আপোনাৰ প্ৰথম উদ্ভিদৰ ছবি লওক!
or: କୌଣସି ପୂର୍ବ ନିଦାନ ନାହିଁ ଆପଣଙ୍କର ପ୍ରଥମ ଉଦ୍ଭିଦ ଫୋଟୋ ନିଅନ୍ତୁ!

source: Please select at least one crop
as: অনুগ্ৰহ কৰি কমেও এটা ফসল বাছনি কৰক
or: ଦୟାକରି କମରେ କମ ଗୋଟିଏ ଫସଲ ଚୟନ କରନ୍ତୁ

source: Rice
as: ধান
or: ଚାଉଳ

source: Wheat
as: গম
or: ଗହମ

source: Corn
as: ভুট্টা
or: ଭୁଟ୍ଟା

source: Tomato
as: টমেটো
or: ଟମାଟୋ

source: Potato
as: আলু
or: ଆଲୁ

source: Onion
as: পিয়াজ
or: ପିଆଜ

source: Cotton
as: তুলা
or: ତୁଳା

source: Sugarcane
as: চেনাগুৰ
or: ଗୁଡ଼ା

source: Soybean
as: সোয়াবিন
or: ସୋୟାବୀନ୍

source: Millet
as: বাজৰা
or: ବାଜରା

# weWillAutomaticallyDetectSoilType
source: We will automatically detect your soil type based on your location to provide better recommendations for your specific crops and farming conditions.
as: আপোনাৰ নিৰ্দিষ্ট ফসল আৰু কৃষিৰ অৱস্থাৰ বাবে উন্নত পৰামৰ্শ প্ৰদান কৰিবলৈ আমি আপোনাৰ অৱস্থানৰ ওপৰত ভিত্তি কৰি আপোনাৰ মাটিৰ ধৰণ স্বয়ংক্ৰিয়ভাৱে চিনাক্ত কৰিম।
or: ଆପଣଙ୍କର ନିର୍ଦ୍ଦିଷ୍ଟ ଫସଲ ଏବଂ କୃଷି ଅବସ୍ଥାଗୁଡ଼ିକ ପାଇଁ ଉତ୍ତମ ପରାମର୍ଶ ପ୍ରଦାନ କରିବା ପାଇଁ ଆମେ ଆପଣଙ୍କର ଅବସ୍ଥିତି ଉପରେ ଆଧାର କରି ଆପଣଙ୍କର ମାଟିର ପ୍ରକାରକୁ ସ୍ୱୟଂଚାଳିତ ଭାବରେ ଚିହ୍ନଟ କରିବୁ।

# weWillAutomaticallyDetectSoilTypeTitle
source: We will automatically detect your soil type based on your location to provide better recommendations for your specific crops and farming conditions.
as: আপোনাৰ নিৰ্দিষ্ট ফসল আৰু কৃষিৰ অৱস্থাৰ বাবে উন্নত পৰামৰ্শ প্ৰদান কৰিবলৈ আমি আপোনাৰ অৱস্থানৰ ওপৰত ভিত্তি কৰি আপোনাৰ মাটিৰ ধৰণ স্বয়ংক্ৰিয়ভাৱে চিনাক্ত কৰিম।
or: ଆପଣଙ୍କର ନିର୍ଦ୍ଦିଷ୍ଟ ଫସଲ ଏବଂ କୃଷି ଅବସ୍ଥାଗୁଡ଼ିକ ପାଇଁ ଉତ୍ତମ ପରାମର୍ଶ ପ୍ରଦାନ କରିବା ପାଇଁ ଆମେ ଆପଣଙ୍କର ଅବସ୍ଥିତି ଉପରେ ଆଧାର କରି ଆପଣଙ୍କର ମାଟିର ପ୍ରକାରକୁ ସ୍ୱୟଂଚାଳିତ ଭାବରେ ଚିହ୍ନଟ କରିବୁ।

source: Healthy
as: সুস্থ

source: Disease
as: ৰোগ

source: Pest
as: কীট

source: Nutrient Deficiency
as: পুষ্টি ঘাটতি

source: Plant Healthy
as: উদ্ভিদ সুস্থ

source: Bacterial Leaf Blight
as: বেক্টেৰিয়াল পাত ৰোগ

source: Brown Spot
as: বাদামী ৰঙৰ দাগ

source: Leaf Blast
as: পাত ফুটা

source: Leaf Scald
as: পাত খৰচোৱা

source: Narrow Brown Spot
as: সৰু বাদামী ৰঙৰ দাগ

source: Sheath Blight
as: শিওৰ ফুটা

source: Stem Rot
as: ডাঙৰ পচা

source: Yellow Stem Borer
as: হালধীয়া ডাঙৰ বোৰাৰ

source: Brown Plant Hopper
as: বাদামী ৰঙৰ হপাৰ

source: Gall Midge
as: গল মিজ

source: Rice Hispa
as: ধান হিসপা

source: Leaf Folder
as: পাত ফোল্ডাৰ

source: Nitrogen Deficiency
as: নাইট্ৰজেন ঘাটতি

source: Phosphorus Deficiency
as: ফছফৰাচ ঘাটতি

source: Potassium Deficiency
as: পটেছিয়াম ঘাটতি

source: Zinc Deficiency
as: জিংক ঘাটতি

source: Iron Deficiency
as: আয়ৰন ঘাটতি

source: Spray
as: স্প্ৰে

source: Fertilizer
as: সাৰ

source: Pesticide
as: কীটনাশক

source: Water
as: পানী

source: Pruning
as: ছাটা

source: Save to History
as: ইতিহাচলৈ সংৰক্ষণ কৰক

source: Close
as: বন্ধ কৰক

source: Unknown Condition
as: অজ্ঞাত অৱস্থা

source: Unknown
as: অজ্ঞাত

source: Analysis completed
as: বিশ্লেষণ সম্পূৰ্ণ

source: Plant Analysis Complete
as: উদ্ভিদ বিশ্লেষণ সম্পূৰ্ণ

source: Analysis
as: বিশ্লেষণ

# consultAgriculturalExpert
source: Consult with agricultural expert
as: কৃষি বিশেষজ্ঞৰ সৈতে পৰামৰ্শ কৰক
